from plotter import plot_graphic
from extremum import find_extremum


def main():
    glr, fib, dich = find_extremum()
    plot_graphic()
    print("--------------------------------------------------------------")
    print("Экстремум, полученный с помощью метода Дихотомии", dich[0])
    print("Значение функции в точке экстремума:", dich[1])
    print(dich[2])
    print("--------------------------------------------------------------")
    print("Экстремум, полученный с помощью метода Золотого сечения:", glr[0])
    print("Значение функции в точке экстремума:", glr[1])
    print(glr[2])
    print("--------------------------------------------------------------")
    print("Экстремум, полученный с помощью метода Фибоначчи", fib[0])
    print("Значение функции в точке экстремума:", fib[1])
    print(fib[2])

if __name__ == "__main__":
    main()
